Задание #198
Считается вся численность отдела вместо нужной части
Отчёт должен показывать, сколько сотрудников в каждом отделе имеют руководителя. Отделов в выдаче столько же, сколько в компании, но числа завышены: в них попадают и те сотрудники, у кого руководителя нет.

У части сотрудников в колонке manager_id ничего не записано.

Выведите department_id (id отдела) и employees_with_manager (число сотрудников отдела, у которых есть руководитель).
Найдите ошибку в запросе

Поля в результирующей таблице:
department_idemployees_with_manager

Решение:

SELECT department_id,
       COUNT(*) AS employees_with_manager
FROM employees 
WHERE manager_id IS NOT NULL 
GROUP BY department_id